Thread/ab-result.log
//ab-result.log
dengwei@dengweis-MacBook-Pro:~/project/github/javaCourse/Thread$ ab  -r -n 500 -c 20 http://localhost:8080/
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      20
Time taken for tests:   0.205 seconds
Complete requests:      500
Failed requests:        65
   (Connect: 0, Receive: 62, Length: 3, Exceptions: 0)
Total transferred:      28000 bytes
HTML transferred:       6500 bytes
Requests per second:    2435.58 [#/sec] (mean)
Time per request:       8.212 [ms] (mean)
Time per request:       0.411 [ms] (mean, across all concurrent requests)
Transfer rate:          133.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   4.0      0      42
Processing:     0    7   7.6      4      47
Waiting:        0    6   6.5      4      43
Total:          1    8   8.5      5      50

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      7
  75%      8
  80%      9
  90%     15
  95%     17
  98%     48
  99%     48
 100%     50 (longest request)
dengwei@dengweis-MacBook-Pro:~/project/github/javaCourse/Thread$ 
dengwei@dengweis-MacBook-Pro:~/project/github/javaCourse/Thread$ 
dengwei@dengweis-MacBook-Pro:~/project/github/javaCourse/Thread$ ab  -r -n 500 -c 20 http://localhost:8080/
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      20
Time taken for tests:   0.154 seconds
Complete requests:      500
Failed requests:        308
   (Connect: 0, Receive: 308, Length: 0, Exceptions: 0)
Total transferred:      28896 bytes
HTML transferred:       6708 bytes
Requests per second:    3239.06 [#/sec] (mean)
Time per request:       6.175 [ms] (mean)
Time per request:       0.309 [ms] (mean, across all concurrent requests)
Transfer rate:          182.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   2.0      3      11
Processing:     0    3   2.9      2      13
Waiting:        0    2   2.5      1      12
Total:          1    6   3.2      5      17

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      7
  80%      8
  90%     12
  95%     13
  98%     14
  99%     15
 100%     17 (longest request)
dengwei@dengweis-MacBook-Pro:~/project/github/javaCourse/Thread$ ab  -r -n 500 -c 20 http://localhost:8080/
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      20
Time taken for tests:   0.141 seconds
Complete requests:      500
Failed requests:        124
   (Connect: 0, Receive: 124, Length: 0, Exceptions: 0)
Total transferred:      28112 bytes
HTML transferred:       6526 bytes
Requests per second:    3540.93 [#/sec] (mean)
Time per request:       5.648 [ms] (mean)
Time per request:       0.282 [ms] (mean, across all concurrent requests)
Transfer rate:          194.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.9      1      18
Processing:     0    3   3.8      2      22
Waiting:        0    3   3.7      2      22
Total:          1    5   3.9      4      23

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      5
  80%      6
  90%     11
  95%     14
  98%     19
  99%     22
 100%     23 (longest request)
dengwei@dengweis-MacBook-Pro:~/project/github/javaCourse/Thread$